import CaseInfo from "./utils";

const case01 = new CaseInfo();
case01.title = "徐学士四十一岁占前程";
case01.dateTimeZh = {
  Y: "戊申",
  M: "未知",
  D: "甲子",
  H: "巳",
  m: "亥",
};
case01.user = {
  root: "戊辰",
  flow: "未知",
};
case01.stemIndex = 7;
case01.godsIndex = 8;
case01.godsLayout = false;
case01.sike = {
  1: {
    bottom: "甲", // 下
    top: "申", // 上
    god: "龙", // 官
    bottomAttr: "阳木", // 五行
    topAttr: "阳金", // 五行
  },
  2: {
    bottom: "申", // 下
    top: "寅", // 上
    god: "后", // 官
    bottomAttr: "阳金", // 五行
    topAttr: "阳土", // 五行
  },
  3: {
    bottom: "子", // 下
    top: "午", // 上
    god: "虎", // 官
    bottomAttr: "阳水", // 五行
    topAttr: "阳火", // 五行
  },
  4: {
    bottom: "午", // 下
    top: "子", // 上
    god: "蛇", // 官
    bottomAttr: "阳火", // 五行
    topAttr: "阳水", // 五行
  },
};
case01.sanchuan = {
  1: {
    lq: "兄", // 六亲
    dun: "丙", // 遁干
    chuan: "寅", // 传
    god: "后", // 乘
    isEmpty: false, // 空
    sha: "无", // 煞
    wu: "无", // 五气
    shier: "无", // 十二
  },
  2: {
    lq: "官", // 六亲
    dun: "壬", // 遁干
    chuan: "申", // 传
    god: "龙", // 乘
    isEmpty: false, // 空
    sha: "无", // 煞
    wu: "无", // 五气
    shier: "无", // 十二
  },
  3: {
    lq: "兄", // 六亲
    dun: "丙", // 遁干
    chuan: "寅", // 传
    god: "后", // 乘
    isEmpty: false, // 空
    sha: "无", // 煞
    wu: "无", // 五气
    shier: "无", // 十二
  },
};

case01.result = `愚按：\r\n
  寅为德禄，马作天后为恩泽，寅与戌为三合，故戌年及第，寅既有两重又生支上午火子孙，故子亦沾恩，
  但返吟事不悠久，虽有德禄诸吉及第后而即亡也，禄临绝地，岂能食禄乎。
  程圣一日此课全在德禄马上看出功名。
  郑体功先生曰两重禄马日德官星，当有两重功名，一重系占人不待言矣，仍一重看支上是何六亲，今支上午为子息故父子同及第。
  邵彦和曰：
  本主身庚戌年及第，唱名当在第三甲。令郎当亦沾恩。
  至庚戌年，徐果中，在第三甲，其子习春秋，中在第五甲。
  徐铨试不中，六月授潭州司户，七月病死。甲寅年其子亦死。
  盖因日上见申，读书人见之为无后，又是太岁来克干，当年即应不宁。
  何直至庚戌年中后方死耶？盖因行年上子水生甲木，宅上午火制申金，且是催官使者，须见官而后死。及至庚戌年，行年在申，甲木临申金而绝，故死。
  初末寅作天后，两重两露恩神，在官星之上，甲与寅皆承其恩泽。甲尊也，父也；寅卑也，子也。故俱沾恩。
  庚戌年身死，甲寅年子死，乃刑冲之故。又行年神克第三课，死神乘白虎入宅，为水所克，又甲木以午为子息，故子必受殃也。
  `;

export default {
  case01,
};
