/**
 * 干支的类型定义
 */
declare type ZhiName =
    | "子"
    | "丑"
    | "寅"
    | "卯"
    | "辰"
    | "巳"
    | "午"
    | "未"
    | "申"
    | "酉"
    | "戌"
    | "亥";

declare type GanName =
    | "甲"
    | "乙"
    | "丙"
    | "丁"
    | "戊"
    | "己"
    | "庚"
    | "辛"
    | "壬"
    | "癸";

/**
 * 十二神将
 */

declare type GuiRen =
    | "贵人"
    | "螣蛇"
    | "朱雀"
    | "六合"
    | "勾陈"
    | "青龙"
    | "天空"
    | "白虎"
    | "太常"
    | "玄武"
    | "太阴"
    | "天后";
// declare guiRenList: Array<GuiRen> = [
//   "贵人",
//   "螣蛇",
//   "朱雀",
//   "六合",
//   "勾陈",
//   "青龙",
//   "天空",
//   "白虎",
//   "太常",
//   "玄武",
//   "太阴",
//   "天后",
// ];
